app/Controllers/ContraseñaController.php

SELECT *
FROM `usuario`
WHERE `email` = 'juliabonetto@alumnos.itr3.edu.ar'
 LIMIT 1
INSERT INTO `password_resets` (`email`, `token`) VALUES ('juliabonetto@alumnos.itr3.edu.ar', 'd821d792a79fe4bf7adfad9f04ae0a1bcb04619be71bb959f43d776de9391159')
---
    public function enviarRecuperacion()
    {
        $email = strtolower(trim((string)$this->request->getPost('email')));
        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->where('email', $email)->first();

        if (!$usuario) {
            return redirect()->back()->with('error', 'Ese correo no está registrado.');
        }

        $token = bin2hex(random_bytes(32));
        $resetModel = new PasswordResetModel();

        // Opcional: Borrar tokens viejos de este correo para no saturar la tabla
        $resetModel->where('email', $email)->delete();

        $resetModel->insert(['email' => $email, 'token' => $token]);

SELECT *
FROM `password_resets`
WHERE `token` = 'c3f7e6f28fdbf8aab0206d586db43ba20f1cd1ffea58fcc65ed68260314438ea'
 LIMIT 1
---
    public function restablecer($token)
    {
        $resetModel = new PasswordResetModel();
        $registro = $resetModel->where('token', $token)->first();