app/Controllers/EstadisticaController.php

SELECT *
FROM `usuario_dispositivo`
WHERE `usuario_id` = '9'
AND `dispositivo_id` = '8'
SELECT *
FROM `dispositivos`
WHERE `id` = '8'
---
    public function show($id)
    {
        $usuarioId = session()->get('id');
        if (!$usuarioId) {
            return redirect()->to('/usuario/login')->with('error', 'Debes iniciar sesión primero.');
        }

        $id = (int) $id;
        $db = \Config\Database::connect();
        $acceso = $db->table('usuario_dispositivo')
            ->where('usuario_id', (int) $usuarioId)
            ->where('dispositivo_id', $id)
            ->get()
            ->getFirstRow();

        if (!$acceso) {
            return redirect()->to('/mis-tachos')->with('error', 'No tenés acceso a este Eco-Tacho.');
        }

        session()->set('dispositivo_actual', $id);

        $tacho = $db->table('dispositivos')
            ->where('id', $id)
            ->get()
            ->getFirstRow();