app/Controllers/TachosController.php

    public function mistachos()
    {
        $usuarioId = $this->requireUser();

        if (!$usuarioId) {
            return redirect()
                ->to('/usuario/login')
                ->with('error', 'Debes iniciar sesión primero.');
        }

        $db = \Config\Database::connect();

        $tachos = $db->table('usuario_dispositivo ud')
            ->select('d.*, ud.rol')
            ->join(
                'dispositivos d',
                'd.id = ud.dispositivo_id'
            )
            ->where('ud.usuario_id', $usuarioId)
            ->orderBy('d.id', 'ASC')
            ->get()
            ->getResult();
---
SELECT `d`.*, `ud`.`rol`
FROM `usuario_dispositivo` `ud`
JOIN `dispositivos` `d` ON `d`.`id` = `ud`.`dispositivo_id`
WHERE `ud`.`usuario_id` = 8
ORDER BY `d`.`id` ASC