app/Controllers/TachosController.php

public function mistachos()
{
    $usuario_id = session()->get('id');
    $db = \Config\Database::connect();


    $tachos = $db->table('usuario_dispositivo ud')
        ->select('d.*, ud.rol')
        ->join('dispositivos d', 'd.id = ud.dispositivo_id')
        ->where('ud.usuario_id', $usuario_id)
        ->get()
        ->getResult();
---
SELECT `d`.*, `ud`.`rol`
FROM `usuario_dispositivo` `ud`
JOIN `dispositivos` `d` ON `d`.`id` = `ud`.`dispositivo_id`
WHERE `ud`.`usuario_id` = '8'