app/Controllers/UsuarioController.php

    public function iniciarSesion()
    {
        $rules = [
            'email' => 'required|valid_email',
            'contraseña' => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Completá correctamente los campos.');
        }

        $usuarioModel = new UsuarioModel();
        $email = strtolower(trim((string) $this->request->getPost('email')));
        $contraseña = (string) $this->request->getPost('contraseña');
        $usuario = $usuarioModel->where('email', $email)->first();

        if (!$usuario || !password_verify($contraseña, $usuario['contraseña'])) {
            return redirect()->back()->withInput()->with('error', 'Credenciales incorrectas.');
        }

        session()->regenerate(true);
        session()->set([
            'usuario' => $usuario,
            'id' => $usuario['id'],
            'nombre' => $usuario['nombre'],
            'apellido' => $usuario['apellido']
        ]);

        $db = \Config\Database::connect();
        $primerDispositivo = $db->table('usuario_dispositivo')
            ->select('dispositivo_id')
            ->where('usuario_id', $usuario['id'])
            ->orderBy('id', 'ASC')
            ->get()
            ->getFirstRow();
---
SELECT *
FROM `usuario`
WHERE `email` = 'juliabonetto1@alumnos.itr3.edu.ar'
 LIMIT 1
SELECT `dispositivo_id`
FROM `usuario_dispositivo`
WHERE `usuario_id` = '10'
ORDER BY `id` ASC

    public function principal()
    {
        if ($redirect = $this->verificarSesion()) {
            return $redirect;
        }

        $usuario = session()->get('usuario');
        $usuarioId = (int) $usuario['id'];
        $clasificacionModel = new ClasificacionModel();
        $estadisticaModel = new EstadisticaModel();
        $dispositivoModel = new DispositivoModel();
        $db = \Config\Database::connect();

        $tachos = $db->table('usuario_dispositivo ud')
            ->select('d.id,d.nombre,d.ubicacion,d.tipo,d.codigo_activacion,d.habilitado,ud.rol')
            ->join('dispositivos d', 'd.id = ud.dispositivo_id')
            ->where('ud.usuario_id', $usuarioId)
            ->orderBy('d.id', 'ASC')
            ->get()
            ->getResultArray();

        $dispositivoId = session()->get('dispositivo_actual');
---
SELECT `d`.`id`, `d`.`nombre`, `d`.`ubicacion`, `d`.`tipo`, `d`.`codigo_activacion`, `d`.`habilitado`, `ud`.`rol`
FROM `usuario_dispositivo` `ud`
JOIN `dispositivos` `d` ON `d`.`id` = `ud`.`dispositivo_id`
WHERE `ud`.`usuario_id` = 8
ORDER BY `d`.`id` ASC
SELECT *
FROM `dispositivos`
WHERE `dispositivos`.`id` = '7'

            }
        }

        $tachoSeleccionado = $dispositivoId ? $dispositivoModel->find($dispositivoId) : null;

        $alertaTacho = null;
        if ($dispositivoId) {
            $alertaTacho = $db->table('dispositivos')
                ->select('id,nombre,alerta_papel,distancia_papel')
                ->where('id', $dispositivoId)
                ->get()
                ->getFirstRow('array');
---
SELECT *
FROM `dispositivos`
WHERE `dispositivos`.`id` = 19
SELECT `id`, `nombre`, `alerta_papel`, `distancia_papel`
FROM `dispositivos`
WHERE `id` = 19