app/Controllers/UsuarioController.php

  public function iniciarSesion() {
    $rules = [
      'email' => 'required|valid_email',
      'contraseña' => 'required'
    ];

    if (!$this->validate($rules)) {
      return redirect()->back()->withInput()->with('error', 'Completá correctamente los campos.');
    }

    $usuarioModel = new UsuarioModel();
    $email = strtolower(trim($this->request->getPost('email')));
    $contraseña = $this->request->getPost('contraseña');
    $usuario = $usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuario`
WHERE `email` = 'juliabonetto@alumnos.itr3.edu.ar'
 LIMIT 1