app/Models/ClasificacionModel.php

SELECT `id`, `dispositivo_id`, `fecha_hora`, `residuo`, `clasificacion`, `categoria_final`
FROM `clasificaciones`
WHERE `dispositivo_id` = 19
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `clasificaciones`
WHERE `dispositivo_id` = 19
AND `fecha_hora` >= '2026-09-30 00:00:00'
AND `fecha_hora` <= '2026-09-30 23:59:59'
---
public function obtenerResiduosHoy(int $dispositivoId): int
{
    $hoy = date('Y-m-d');

    $registros = $this->db->table('clasificaciones')
        ->select('id, dispositivo_id, fecha_hora, residuo, clasificacion, categoria_final')
        ->where('dispositivo_id', $dispositivoId)
        ->orderBy('id', 'DESC')
        ->limit(10)
        ->get()
        ->getResultArray();

    log_message(
        'error',
        'ECOSCAM DEBUG - dispositivo_id=' . $dispositivoId .
        ' | FECHA PHP=' . $hoy .
        ' | ULTIMOS REGISTROS=' . json_encode($registros, JSON_UNESCAPED_UNICODE)
    );

    $cantidad = (int) $this->db->table('clasificaciones')
        ->where('dispositivo_id', $dispositivoId)
        ->where('fecha_hora >=', $hoy . ' 00:00:00')
        ->where('fecha_hora <=', $hoy . ' 23:59:59')
        ->countAllResults();